open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_m2m.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_jpeg_m2m.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 AP JPEG decoder V4L2 memory-to-memory adapter.
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <debug.h>

#include <nuttx/cache.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>
#include <nuttx/video/v4l2_m2m.h>
#include <nuttx/wqueue.h>

#include <arch/chip/bk7258_jpeg_decoder.h>
#include <arch/chip/bk7258_jpeg_m2m.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_JPEG_M2M_NAME              "bk7258-jpeg"
#define BK7258_JPEG_M2M_WORKER_NAME       "bkjpeg-m2m"
#define BK7258_JPEG_M2M_BUFFER_COUNT      2u
#define BK7258_JPEG_M2M_PIXEL_BYTES       2u

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_jpeg_m2m_file_s
{
  mutex_t life_lock;
  mutex_t state_lock;
  FAR struct kwork_wqueue_s *wqueue;
  struct work_s work;
  FAR void *cookie;
  FAR struct bk7258_jpeg_decoder_s *decoder;
  struct v4l2_format output_fmt;
  struct v4l2_format capture_fmt;
  uint32_t epoch;
  uint32_t sequence;
  bool output_on;
  bool capture_on;
  bool closing;
  bool inflight;
  bool formats_locked;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int bk7258_jpeg_m2m_open(FAR void *cookie, FAR void **priv);
static int bk7258_jpeg_m2m_close(FAR void *arg);
static int bk7258_jpeg_m2m_capture_streamon(FAR void *arg);
static int bk7258_jpeg_m2m_output_streamon(FAR void *arg);
static int bk7258_jpeg_m2m_capture_streamoff(FAR void *arg);
static int bk7258_jpeg_m2m_output_streamoff(FAR void *arg);
static int bk7258_jpeg_m2m_available(FAR void *arg);
static int bk7258_jpeg_m2m_querycap(
  FAR void *arg, FAR struct v4l2_capability *cap);
static int bk7258_jpeg_m2m_capture_enum_fmt(
  FAR void *arg, FAR struct v4l2_fmtdesc *fmt);
static int bk7258_jpeg_m2m_output_enum_fmt(
  FAR void *arg, FAR struct v4l2_fmtdesc *fmt);
static int bk7258_jpeg_m2m_capture_g_fmt(
  FAR void *arg, FAR struct v4l2_format *fmt);
static int bk7258_jpeg_m2m_output_g_fmt(
  FAR void *arg, FAR struct v4l2_format *fmt);
static int bk7258_jpeg_m2m_capture_s_fmt(
  FAR void *arg, FAR struct v4l2_format *fmt);
static int bk7258_jpeg_m2m_output_s_fmt(
  FAR void *arg, FAR struct v4l2_format *fmt);
static int bk7258_jpeg_m2m_capture_try_fmt(
  FAR void *arg, FAR struct v4l2_format *fmt);
static int bk7258_jpeg_m2m_output_try_fmt(
  FAR void *arg, FAR struct v4l2_format *fmt);
static size_t bk7258_jpeg_m2m_capture_g_bufsize(FAR void *arg);
static size_t bk7258_jpeg_m2m_output_g_bufsize(FAR void *arg);
static size_t bk7258_jpeg_m2m_g_bufcnt(FAR void *arg);
static int bk7258_jpeg_m2m_try_memory(
  FAR void *arg, enum v4l2_memory memory);
static void bk7258_jpeg_m2m_worker(FAR void *arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct codec_ops_s g_bk7258_jpeg_m2m_ops =
{
  .open               = bk7258_jpeg_m2m_open,
  .close              = bk7258_jpeg_m2m_close,
  .capture_streamon   = bk7258_jpeg_m2m_capture_streamon,
  .output_streamon    = bk7258_jpeg_m2m_output_streamon,
  .capture_streamoff  = bk7258_jpeg_m2m_capture_streamoff,
  .output_streamoff   = bk7258_jpeg_m2m_output_streamoff,
  .capture_available  = bk7258_jpeg_m2m_available,
  .output_available   = bk7258_jpeg_m2m_available,
  .querycap           = bk7258_jpeg_m2m_querycap,
  .capture_enum_fmt   = bk7258_jpeg_m2m_capture_enum_fmt,
  .output_enum_fmt    = bk7258_jpeg_m2m_output_enum_fmt,
  .capture_g_fmt      = bk7258_jpeg_m2m_capture_g_fmt,
  .output_g_fmt       = bk7258_jpeg_m2m_output_g_fmt,
  .capture_s_fmt      = bk7258_jpeg_m2m_capture_s_fmt,
  .output_s_fmt       = bk7258_jpeg_m2m_output_s_fmt,
  .capture_try_fmt    = bk7258_jpeg_m2m_capture_try_fmt,
  .output_try_fmt     = bk7258_jpeg_m2m_output_try_fmt,
  .capture_g_bufsize  = bk7258_jpeg_m2m_capture_g_bufsize,
  .output_g_bufsize   = bk7258_jpeg_m2m_output_g_bufsize,
  .capture_g_bufcnt   = bk7258_jpeg_m2m_g_bufcnt,
  .output_g_bufcnt    = bk7258_jpeg_m2m_g_bufcnt,
  .capture_try_memory = bk7258_jpeg_m2m_try_memory,
  .output_try_memory  = bk7258_jpeg_m2m_try_memory,
};

static struct codec_s g_bk7258_jpeg_m2m_codec =
{
  .ops = &g_bk7258_jpeg_m2m_ops,
};

/* The immutable SDK decoder is a singleton.  A failed uninitialize keeps
 * that SDK owner alive, so retain it outside the per-open object and retry
 * cleanup before the next initialize instead of losing the only valid
 * handle. */

static mutex_t g_bk7258_jpeg_m2m_device_lock = NXMUTEX_INITIALIZER;
static FAR struct bk7258_jpeg_decoder_s *g_bk7258_jpeg_m2m_orphan;
static bool g_bk7258_jpeg_m2m_opened;
static bool g_bk7258_jpeg_m2m_registered;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static bool bk7258_jpeg_m2m_exact_output_type(uint32_t type)
{
  return type == V4L2_BUF_TYPE_VIDEO_OUTPUT;
}

static bool bk7258_jpeg_m2m_exact_capture_type(uint32_t type)
{
  return type == V4L2_BUF_TYPE_VIDEO_CAPTURE;
}

static int bk7258_jpeg_m2m_capture_sizes(uint32_t width, uint32_t height,
                                         FAR uint32_t *payload,
                                         FAR uint32_t *storage,
                                         FAR size_t *cache_line)
{
  uint64_t payload64;
  uint64_t storage64;
  size_t line;

