open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_m2m.c
  if (payload == NULL || storage == NULL)
    {
      return -EINVAL;
    }

  line = up_get_dcache_linesize();
  if (line == 0)
    {
      line = sizeof(uintptr_t);
    }

  if ((line & (line - 1)) != 0)
    {
      return -EIO;
    }

  payload64 = (uint64_t)width * height * BK7258_JPEG_M2M_PIXEL_BYTES;
  if (payload64 == 0 || payload64 > UINT32_MAX)
    {
      return -EOVERFLOW;
    }

  storage64 = (payload64 + line - 1) & ~((uint64_t)line - 1);
  if (storage64 > UINT32_MAX)
    {
      return -EOVERFLOW;
    }

  *payload = (uint32_t)payload64;
  *storage = (uint32_t)storage64;
  if (cache_line != NULL)
    {
      *cache_line = line;
    }

  return 0;
}

static int bk7258_jpeg_m2m_check_config(void)
{
  uint32_t capture_payload;
  uint32_t capture_storage;

  if (CONFIG_BK7258_JPEG_M2M_DEFAULT_HEIGHT < 1 ||
      CONFIG_BK7258_JPEG_M2M_MAX_WIDTH < 2 ||
      CONFIG_BK7258_JPEG_M2M_MAX_HEIGHT < 1 ||
      CONFIG_BK7258_JPEG_M2M_DEFAULT_WIDTH >
        CONFIG_BK7258_JPEG_M2M_MAX_WIDTH ||
      CONFIG_BK7258_JPEG_M2M_DEFAULT_HEIGHT >
        CONFIG_BK7258_JPEG_M2M_MAX_HEIGHT ||
      CONFIG_BK7258_JPEG_M2M_MAX_WIDTH > UINT16_MAX ||
      CONFIG_BK7258_JPEG_M2M_MAX_HEIGHT > UINT16_MAX ||
      CONFIG_BK7258_JPEG_M2M_MAX_INPUT_SIZE < 1 ||
      CONFIG_BK7258_JPEG_M2M_WORKER_STACKSIZE < 1)
    {
      return -EINVAL;
    }

  return bk7258_jpeg_m2m_capture_sizes(
    CONFIG_BK7258_JPEG_M2M_MAX_WIDTH & ~1u,
    CONFIG_BK7258_JPEG_M2M_MAX_HEIGHT,
    &capture_payload, &capture_storage, NULL);
}

static uint32_t bk7258_jpeg_m2m_width(uint32_t width)
{
  uint32_t maximum = CONFIG_BK7258_JPEG_M2M_MAX_WIDTH & ~1u;

  if (width < 2)
    {
      width = CONFIG_BK7258_JPEG_M2M_DEFAULT_WIDTH;
    }

  if (width < 2)
    {
      width = 2;
    }

  if (width > maximum)
    {
      width = maximum;
    }

  return width & ~1u;
}

static uint32_t bk7258_jpeg_m2m_height(uint32_t height)
{
  if (height < 1)
    {
      height = CONFIG_BK7258_JPEG_M2M_DEFAULT_HEIGHT;
    }

  if (height > CONFIG_BK7258_JPEG_M2M_MAX_HEIGHT)
    {
      height = CONFIG_BK7258_JPEG_M2M_MAX_HEIGHT;
    }

  return height;
}

static void bk7258_jpeg_m2m_make_output_format(
  FAR struct v4l2_format *fmt, uint32_t width, uint32_t height)
{
  memset(fmt, 0, sizeof(*fmt));
  fmt->type = V4L2_BUF_TYPE_VIDEO_OUTPUT;
  fmt->fmt.pix.width = width;
  fmt->fmt.pix.height = height;
  fmt->fmt.pix.pixelformat = V4L2_PIX_FMT_JPEG;
  fmt->fmt.pix.field = V4L2_FIELD_NONE;
  fmt->fmt.pix.bytesperline = 0;
  fmt->fmt.pix.sizeimage = CONFIG_BK7258_JPEG_M2M_MAX_INPUT_SIZE;
  fmt->fmt.pix.colorspace = V4L2_COLORSPACE_JPEG;
}

static int bk7258_jpeg_m2m_make_capture_format(
  FAR struct v4l2_format *fmt, uint32_t width, uint32_t height)
{
  uint32_t payload;
  uint32_t storage;
  int ret;

  ret = bk7258_jpeg_m2m_capture_sizes(width, height, &payload, &storage,
                                       NULL);
  if (ret < 0)
    {
      return ret;
    }

  memset(fmt, 0, sizeof(*fmt));
  fmt->type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  fmt->fmt.pix.width = width;
  fmt->fmt.pix.height = height;
  fmt->fmt.pix.pixelformat = V4L2_PIX_FMT_YUYV;
  fmt->fmt.pix.field = V4L2_FIELD_NONE;
  fmt->fmt.pix.bytesperline = payload / height;
  fmt->fmt.pix.sizeimage = storage;
  fmt->fmt.pix.colorspace = V4L2_COLORSPACE_JPEG;
  return 0;
}

static int bk7258_jpeg_m2m_retry_orphan_locked(void)
{
  int ret;

  if (g_bk7258_jpeg_m2m_orphan == NULL)
    {
      return 0;
    }

  ret = bk7258_jpeg_decoder_uninitialize(g_bk7258_jpeg_m2m_orphan);
  if (ret >= 0)
    {
      g_bk7258_jpeg_m2m_orphan = NULL;
    }

  return ret;
}

/* Initialize can return an error together with a recovery-only handle when
 * immutable-SDK rollback itself fails.  Preserve that handle as the sole
 * orphan so a later open can finish teardown instead of creating a second
 * hardware owner.  The device lock is held by every caller. */

static int bk7258_jpeg_m2m_initialize_backend_locked(
  FAR struct bk7258_jpeg_m2m_file_s *priv)
{
  FAR struct bk7258_jpeg_decoder_s *decoder = NULL;
  int ret;

  ret = bk7258_jpeg_decoder_initialize(&decoder);
  if (ret < 0)
    {
      if (decoder != NULL)
        {
          DEBUGASSERT(g_bk7258_jpeg_m2m_orphan == NULL);
          g_bk7258_jpeg_m2m_orphan = decoder;
        }

      priv->decoder = NULL;
      return ret;
    }

  if (decoder == NULL)
    {
      return -EIO;
    }

  priv->decoder = decoder;
  return 0;
}

static int bk7258_jpeg_m2m_claim_backend(
  FAR struct bk7258_jpeg_m2m_file_s *priv)
{
  int ret;

  ret = nxmutex_lock(&g_bk7258_jpeg_m2m_device_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (g_bk7258_jpeg_m2m_opened)
    {
      ret = -EBUSY;
      goto out_unlock;
    }

  ret = bk7258_jpeg_m2m_retry_orphan_locked();
  if (ret < 0)
    {
      goto out_unlock;
    }

  ret = bk7258_jpeg_m2m_initialize_backend_locked(priv);
  if (ret >= 0)
    {
      g_bk7258_jpeg_m2m_opened = true;
    }

out_unlock:
  nxmutex_unlock(&g_bk7258_jpeg_m2m_device_lock);
  return ret;
}

static int bk7258_jpeg_m2m_ensure_backend(
  FAR struct bk7258_jpeg_m2m_file_s *priv)
{
  int ret;

  ret = nxmutex_lock(&g_bk7258_jpeg_m2m_device_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->decoder != NULL)
    {
      ret = 0;
    }
  else
    {
      ret = bk7258_jpeg_m2m_retry_orphan_locked();
      if (ret >= 0)
        {
          ret = bk7258_jpeg_m2m_initialize_backend_locked(priv);
        }
    }

  nxmutex_unlock(&g_bk7258_jpeg_m2m_device_lock);
  return ret;
}

static int bk7258_jpeg_m2m_reset_backend(
  FAR struct bk7258_jpeg_m2m_file_s *priv)
{
  FAR struct bk7258_jpeg_decoder_s *decoder;
  int ret;

  ret = nxmutex_lock(&g_bk7258_jpeg_m2m_device_lock);
  if (ret < 0)
    {
      return ret;
    }

  decoder = priv->decoder;
  priv->decoder = NULL;
  if (decoder != NULL)
    {
      ret = bk7258_jpeg_decoder_uninitialize(decoder);
      if (ret < 0)
        {
          g_bk7258_jpeg_m2m_orphan = decoder;
          goto out_unlock;
        }
    }

  ret = bk7258_jpeg_m2m_retry_orphan_locked();
  if (ret >= 0)
    {
      ret = bk7258_jpeg_m2m_initialize_backend_locked(priv);
    }

out_unlock:
  nxmutex_unlock(&g_bk7258_jpeg_m2m_device_lock);
  return ret;
}

static int bk7258_jpeg_m2m_release_backend(
  FAR struct bk7258_jpeg_m2m_file_s *priv)
{
  FAR struct bk7258_jpeg_decoder_s *decoder;
  int ret = 0;
  int lockret;

