open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_m2m.c
  lockret = nxmutex_lock(&g_bk7258_jpeg_m2m_device_lock);
  if (lockret < 0)
    {
      return lockret;
    }

  decoder = priv->decoder;
  priv->decoder = NULL;
  if (decoder != NULL)
    {
      ret = bk7258_jpeg_decoder_uninitialize(decoder);
      if (ret < 0)
        {
          g_bk7258_jpeg_m2m_orphan = decoder;
        }
    }

  g_bk7258_jpeg_m2m_opened = false;
  nxmutex_unlock(&g_bk7258_jpeg_m2m_device_lock);
  return ret;
}

static bool bk7258_jpeg_m2m_fatal_error(int ret)
{
  return ret == -EIO || ret == -EBUSY || ret == -ETIMEDOUT ||
         ret == -ENODEV || ret == -ESHUTDOWN;
}

/* state_lock is held.  Queueing while holding it closes the race in which
 * close marks the file closing, synchronously cancels the work, and an
 * already-entered available callback queues the same work afterwards. */

static int bk7258_jpeg_m2m_kick_locked(
  FAR struct bk7258_jpeg_m2m_file_s *priv)
{
  if (priv->closing || !priv->output_on || !priv->capture_on ||
      priv->wqueue == NULL)
    {
      return 0;
    }

  return work_queue_wq(priv->wqueue, &priv->work,
                       bk7258_jpeg_m2m_worker, priv, 0);
}

static void bk7258_jpeg_m2m_fail_buffer(
  FAR struct v4l2_buffer *buf, uint32_t type)
{
  buf->type = type;
  buf->flags &= ~V4L2_BUF_FLAG_LAST;
  buf->flags |= V4L2_BUF_FLAG_ERROR;
  if (type == V4L2_BUF_TYPE_VIDEO_CAPTURE)
    {
      buf->bytesused = 0;
      buf->field = V4L2_FIELD_NONE;
    }
}

/* state_lock is held and no worker is queued or running. */

static void bk7258_jpeg_m2m_drain_locked(
  FAR struct bk7258_jpeg_m2m_file_s *priv, uint32_t type)
{
  FAR struct v4l2_buffer *buf;
  int ret;

  for (; ; )
    {
      if (type == V4L2_BUF_TYPE_VIDEO_OUTPUT)
        {
          buf = codec_output_get_buf(priv->cookie);
        }
      else
        {
          buf = codec_capture_get_buf(priv->cookie);
        }

      if (buf == NULL)
        {
          break;
        }

      bk7258_jpeg_m2m_fail_buffer(buf, type);
      ret = type == V4L2_BUF_TYPE_VIDEO_OUTPUT ?
            codec_output_put_buf(priv->cookie, buf) :
            codec_capture_put_buf(priv->cookie, buf);
      if (ret < 0)
        {
          verr("JPEG M2M buffer drain failed: %d\n", ret);
          break;
        }
    }
}

static int bk7258_jpeg_m2m_process(
  FAR struct bk7258_jpeg_m2m_file_s *priv,
  FAR struct v4l2_buffer *src,
  FAR struct v4l2_buffer *dst,
  FAR const struct v4l2_format *capture_fmt,
  FAR uint32_t *bytesused)
{
  struct bk7258_jpeg_decoder_frame_s input;
  struct bk7258_jpeg_decoder_frame_s output;
  struct bk7258_jpeg_decoder_info_s info;
  uint32_t payload;
  uint32_t required;
  size_t cache_line;
  int ret;

  if (!bk7258_jpeg_m2m_exact_output_type(src->type) ||
      !bk7258_jpeg_m2m_exact_capture_type(dst->type) ||
      src->memory != V4L2_MEMORY_USERPTR ||
      dst->memory != V4L2_MEMORY_USERPTR ||
      src->m.vaddr == NULL || dst->m.vaddr == NULL ||
      src->bytesused == 0 || src->length == 0 ||
      src->bytesused > src->length ||
      src->length > CONFIG_BK7258_JPEG_M2M_MAX_INPUT_SIZE ||
      src->bytesused > CONFIG_BK7258_JPEG_M2M_MAX_INPUT_SIZE)
    {
      return -EINVAL;
    }

  ret = bk7258_jpeg_m2m_capture_sizes(
    capture_fmt->fmt.pix.width, capture_fmt->fmt.pix.height,
    &payload, &required, &cache_line);
  if (ret < 0)
    {
      return ret;
    }

  if (required != capture_fmt->fmt.pix.sizeimage ||
      ((uintptr_t)dst->m.vaddr & (cache_line - 1)) != 0)
    {
      return -EINVAL;
    }

  if (required == 0 || dst->length < required)
    {
      return -ENOSPC;
    }

  input = (struct bk7258_jpeg_decoder_frame_s)
  {
    .data = src->m.vaddr,
    .capacity = src->length,
    .length = src->bytesused,
  };

  output = (struct bk7258_jpeg_decoder_frame_s)
  {
    .data = dst->m.vaddr,
    .capacity = dst->length,
  };

  ret = bk7258_jpeg_m2m_ensure_backend(priv);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_jpeg_decoder_get_info(priv->decoder, &input, &info);
  if (ret < 0)
    {
      return ret;
    }

  if (info.width != capture_fmt->fmt.pix.width ||
      info.height != capture_fmt->fmt.pix.height)
    {
      return -EINVAL;
    }

  ret = bk7258_jpeg_decoder_decode(priv->decoder, &input, &output);
  if (ret < 0)
    {
      return ret;
    }

  if (output.width != info.width || output.height != info.height ||
      output.length != payload)
    {
      return -EIO;
    }

  *bytesused = output.length;
  return 0;
}

static void bk7258_jpeg_m2m_worker(FAR void *arg)
{
  FAR struct bk7258_jpeg_m2m_file_s *priv = arg;
  FAR struct v4l2_buffer *src;
  FAR struct v4l2_buffer *dst;
  struct v4l2_format capture_fmt;
  uint32_t bytesused = 0;
  uint32_t epoch;
  bool stale;
  int resetret;
  int ret;

  ret = nxmutex_lock(&priv->state_lock);
  if (ret < 0)
    {
      return;
    }

  if (priv->closing || !priv->output_on || !priv->capture_on)
    {
      nxmutex_unlock(&priv->state_lock);
      return;
    }

  src = codec_output_get_buf(priv->cookie);
  dst = codec_capture_get_buf(priv->cookie);
  if (src == NULL || dst == NULL)
    {
      nxmutex_unlock(&priv->state_lock);
      return;
    }

  epoch = priv->epoch;
  capture_fmt = priv->capture_fmt;
  priv->inflight = true;
  nxmutex_unlock(&priv->state_lock);

  ret = bk7258_jpeg_m2m_process(priv, src, dst, &capture_fmt, &bytesused);
  if (bk7258_jpeg_m2m_fatal_error(ret))
    {
      resetret = bk7258_jpeg_m2m_reset_backend(priv);
      if (resetret < 0)
        {
          verr("JPEG M2M backend recovery failed: %d\n", resetret);
        }
    }

  if (nxmutex_lock(&priv->state_lock) < 0)
    {
      return;
    }

  stale = priv->closing || epoch != priv->epoch ||
          !priv->output_on || !priv->capture_on;

  src->type = V4L2_BUF_TYPE_VIDEO_OUTPUT;
  dst->type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  dst->field = V4L2_FIELD_NONE;
  src->flags &= ~V4L2_BUF_FLAG_LAST;
  dst->flags &= ~V4L2_BUF_FLAG_LAST;

  if (ret < 0 || stale)
    {
      src->flags |= V4L2_BUF_FLAG_ERROR;
      dst->flags |= V4L2_BUF_FLAG_ERROR;
      dst->bytesused = 0;
    }
  else
    {
      src->flags &= ~V4L2_BUF_FLAG_ERROR;
      dst->flags &= ~V4L2_BUF_FLAG_ERROR;
      dst->bytesused = bytesused;
      dst->timestamp = src->timestamp;
      dst->sequence = priv->sequence++;
    }

  ret = codec_output_put_buf(priv->cookie, src);
  if (ret < 0)
    {
      verr("JPEG M2M output completion failed: %d\n", ret);
    }

  ret = codec_capture_put_buf(priv->cookie, dst);
  if (ret < 0)
    {
      verr("JPEG M2M capture completion failed: %d\n", ret);
    }

  priv->inflight = false;
  ret = bk7258_jpeg_m2m_kick_locked(priv);
  if (ret < 0)
    {
      verr("JPEG M2M worker requeue failed: %d\n", ret);
    }

  nxmutex_unlock(&priv->state_lock);
}

static int bk7258_jpeg_m2m_open(FAR void *cookie, FAR void **out)
{
  FAR struct bk7258_jpeg_m2m_file_s *priv;
  uint32_t default_height;
  uint32_t default_width;
  int ret;

