open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_m2m.c
  if (cookie == NULL || out == NULL)
    {
      return -EINVAL;
    }

  *out = NULL;
  priv = kmm_zalloc(sizeof(*priv));
  if (priv == NULL)
    {
      return -ENOMEM;
    }

  ret = nxmutex_init(&priv->life_lock);
  if (ret < 0)
    {
      kmm_free(priv);
      return ret;
    }

  ret = nxmutex_init(&priv->state_lock);
  if (ret < 0)
    {
      nxmutex_destroy(&priv->life_lock);
      kmm_free(priv);
      return ret;
    }

  priv->wqueue = work_queue_create(
    BK7258_JPEG_M2M_WORKER_NAME,
    CONFIG_BK7258_JPEG_M2M_WORKER_PRIORITY,
    NULL, CONFIG_BK7258_JPEG_M2M_WORKER_STACKSIZE, 1);
  if (priv->wqueue == NULL)
    {
      ret = -ENOMEM;
      goto fail;
    }

  ret = bk7258_jpeg_m2m_claim_backend(priv);
  if (ret < 0)
    {
      work_queue_free(priv->wqueue);
      priv->wqueue = NULL;
      goto fail;
    }

  priv->cookie = cookie;
  default_width = bk7258_jpeg_m2m_width(
    CONFIG_BK7258_JPEG_M2M_DEFAULT_WIDTH);
  default_height = bk7258_jpeg_m2m_height(
    CONFIG_BK7258_JPEG_M2M_DEFAULT_HEIGHT);
  bk7258_jpeg_m2m_make_output_format(
    &priv->output_fmt, default_width, default_height);
  ret = bk7258_jpeg_m2m_make_capture_format(
    &priv->capture_fmt, default_width, default_height);
  if (ret < 0)
    {
      (void)bk7258_jpeg_m2m_release_backend(priv);
      work_queue_free(priv->wqueue);
      priv->wqueue = NULL;
      goto fail;
    }

  *out = priv;
  return 0;

fail:
  nxmutex_destroy(&priv->state_lock);
  nxmutex_destroy(&priv->life_lock);
  kmm_free(priv);
  return ret;
}

static int bk7258_jpeg_m2m_close(FAR void *arg)
{
  FAR struct bk7258_jpeg_m2m_file_s *priv = arg;
  int ret;

  if (priv == NULL)
    {
      return 0;
    }

  ret = nxmutex_lock(&priv->life_lock);
  if (ret < 0)
    {
      return 0;
    }

  ret = nxmutex_lock(&priv->state_lock);
  if (ret >= 0)
    {
      priv->closing = true;
      priv->output_on = false;
      priv->capture_on = false;
      priv->epoch++;
      nxmutex_unlock(&priv->state_lock);
    }

  ret = work_cancel_sync_wq(priv->wqueue, &priv->work);
  if (ret < 0 && ret != -ENOENT)
    {
      verr("JPEG M2M close cancel failed: %d\n", ret);
    }

  ret = nxmutex_lock(&priv->state_lock);
  if (ret >= 0)
    {
      bk7258_jpeg_m2m_drain_locked(
        priv, V4L2_BUF_TYPE_VIDEO_OUTPUT);
      bk7258_jpeg_m2m_drain_locked(
        priv, V4L2_BUF_TYPE_VIDEO_CAPTURE);
      nxmutex_unlock(&priv->state_lock);
    }

  ret = work_queue_free(priv->wqueue);
  if (ret < 0)
    {
      verr("JPEG M2M worker join failed: %d\n", ret);
    }

  priv->wqueue = NULL;
  ret = bk7258_jpeg_m2m_release_backend(priv);
  if (ret < 0)
    {
      verr("JPEG M2M backend close retained orphan: %d\n", ret);
    }

  nxmutex_unlock(&priv->life_lock);
  nxmutex_destroy(&priv->state_lock);
  nxmutex_destroy(&priv->life_lock);
  kmm_free(priv);

  /* The generic upper half ignores this return value and frees its queue
   * cookie immediately.  All work and backend callbacks are therefore
   * synchronously quiesced above, and close always reports completion. */

  return 0;
}

static int bk7258_jpeg_m2m_streamon(
  FAR struct bk7258_jpeg_m2m_file_s *priv, bool output)
{
  int ret;

  ret = nxmutex_lock(&priv->life_lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_jpeg_m2m_ensure_backend(priv);
  if (ret < 0)
    {
      goto out_unlock_life;
    }

  ret = nxmutex_lock(&priv->state_lock);
  if (ret < 0)
    {
      goto out_unlock_life;
    }

  if (priv->closing)
    {
      ret = -ESHUTDOWN;
    }
  else
    {
      if (priv->output_fmt.fmt.pix.width !=
          priv->capture_fmt.fmt.pix.width ||
          priv->output_fmt.fmt.pix.height !=
          priv->capture_fmt.fmt.pix.height)
        {
          ret = -EINVAL;
        }
      else if (output && !priv->output_on)
        {
          priv->output_on = true;
          priv->epoch++;
        }
      else if (!output && !priv->capture_on)
        {
          priv->capture_on = true;
          priv->epoch++;
        }

      if (ret >= 0)
        {
          ret = bk7258_jpeg_m2m_kick_locked(priv);
        }
    }

  nxmutex_unlock(&priv->state_lock);

out_unlock_life:
  nxmutex_unlock(&priv->life_lock);
  return ret;
}

static int bk7258_jpeg_m2m_capture_streamon(FAR void *arg)
{
  return arg == NULL ? -EINVAL :
         bk7258_jpeg_m2m_streamon(arg, false);
}

static int bk7258_jpeg_m2m_output_streamon(FAR void *arg)
{
  return arg == NULL ? -EINVAL :
         bk7258_jpeg_m2m_streamon(arg, true);
}

static int bk7258_jpeg_m2m_streamoff(
  FAR struct bk7258_jpeg_m2m_file_s *priv, bool output)
{
  uint32_t type = output ? V4L2_BUF_TYPE_VIDEO_OUTPUT :
                           V4L2_BUF_TYPE_VIDEO_CAPTURE;
  int ret;

  ret = nxmutex_lock(&priv->life_lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = nxmutex_lock(&priv->state_lock);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->life_lock);
      return ret;
    }

  if (output)
    {
      priv->output_on = false;
    }
  else
    {
      priv->capture_on = false;
    }

  priv->epoch++;
  nxmutex_unlock(&priv->state_lock);

  ret = work_cancel_sync_wq(priv->wqueue, &priv->work);
  if (ret < 0 && ret != -ENOENT)
    {
      verr("JPEG M2M streamoff cancel failed: %d\n", ret);
    }

  ret = nxmutex_lock(&priv->state_lock);
  if (ret >= 0)
    {
      bk7258_jpeg_m2m_drain_locked(priv, type);
      nxmutex_unlock(&priv->state_lock);
    }

  nxmutex_unlock(&priv->life_lock);
  return 0;
}

static int bk7258_jpeg_m2m_capture_streamoff(FAR void *arg)
{
  return arg == NULL ? -EINVAL :
         bk7258_jpeg_m2m_streamoff(arg, false);
}

static int bk7258_jpeg_m2m_output_streamoff(FAR void *arg)
{
  return arg == NULL ? -EINVAL :
         bk7258_jpeg_m2m_streamoff(arg, true);
}

static int bk7258_jpeg_m2m_available(FAR void *arg)
{
  FAR struct bk7258_jpeg_m2m_file_s *priv = arg;
  int ret;

  if (priv == NULL)
    {
      return 0;
    }

  ret = nxmutex_lock(&priv->state_lock);
  if (ret >= 0)
    {
      ret = bk7258_jpeg_m2m_kick_locked(priv);
      if (ret < 0)
        {
          verr("JPEG M2M queue kick failed: %d\n", ret);
        }

      nxmutex_unlock(&priv->state_lock);
    }

