open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_m2m.c
  /* codec_qbuf() has already put the container into the generic queue before
   * this callback runs.  Propagating a scheduling error would report QBUF as
   * failed while leaving that buffer owned by the driver. */

  return 0;
}

static int bk7258_jpeg_m2m_querycap(
  FAR void *arg, FAR struct v4l2_capability *cap)
{
  if (arg == NULL || cap == NULL)
    {
      return -EINVAL;
    }

  memset(cap, 0, sizeof(*cap));
  strlcpy((FAR char *)cap->driver, BK7258_JPEG_M2M_NAME,
          sizeof(cap->driver));
  strlcpy((FAR char *)cap->card, BK7258_JPEG_M2M_NAME,
          sizeof(cap->card));
  cap->capabilities = V4L2_CAP_VIDEO_M2M | V4L2_CAP_STREAMING;
  cap->device_caps = cap->capabilities;
  return 0;
}

static int bk7258_jpeg_m2m_capture_enum_fmt(
  FAR void *arg, FAR struct v4l2_fmtdesc *fmt)
{
  if (arg == NULL || fmt == NULL ||
      !bk7258_jpeg_m2m_exact_capture_type(fmt->type) || fmt->index != 0)
    {
      return -EINVAL;
    }

  fmt->pixelformat = V4L2_PIX_FMT_YUYV;
  fmt->flags = 0;
  strlcpy((FAR char *)fmt->description, "YUYV 4:2:2",
          sizeof(fmt->description));
  return 0;
}

static int bk7258_jpeg_m2m_output_enum_fmt(
  FAR void *arg, FAR struct v4l2_fmtdesc *fmt)
{
  if (arg == NULL || fmt == NULL ||
      !bk7258_jpeg_m2m_exact_output_type(fmt->type) || fmt->index != 0)
    {
      return -EINVAL;
    }

  fmt->pixelformat = V4L2_PIX_FMT_JPEG;
  fmt->flags = V4L2_FMT_FLAG_COMPRESSED;
  strlcpy((FAR char *)fmt->description, "JPEG", sizeof(fmt->description));
  return 0;
}

static int bk7258_jpeg_m2m_capture_try_fmt(
  FAR void *arg, FAR struct v4l2_format *fmt)
{
  uint32_t width;
  uint32_t height;

  if (arg == NULL || fmt == NULL ||
      !bk7258_jpeg_m2m_exact_capture_type(fmt->type) ||
      fmt->fmt.pix.pixelformat != V4L2_PIX_FMT_YUYV)
    {
      return -EINVAL;
    }

  width = bk7258_jpeg_m2m_width(fmt->fmt.pix.width);
  height = bk7258_jpeg_m2m_height(fmt->fmt.pix.height);
  return bk7258_jpeg_m2m_make_capture_format(fmt, width, height);
}

static int bk7258_jpeg_m2m_output_try_fmt(
  FAR void *arg, FAR struct v4l2_format *fmt)
{
  uint32_t width;
  uint32_t height;

  if (arg == NULL || fmt == NULL ||
      !bk7258_jpeg_m2m_exact_output_type(fmt->type) ||
      fmt->fmt.pix.pixelformat != V4L2_PIX_FMT_JPEG)
    {
      return -EINVAL;
    }

  width = bk7258_jpeg_m2m_width(fmt->fmt.pix.width);
  height = bk7258_jpeg_m2m_height(fmt->fmt.pix.height);
  bk7258_jpeg_m2m_make_output_format(fmt, width, height);
  return 0;
}

static int bk7258_jpeg_m2m_g_fmt(
  FAR struct bk7258_jpeg_m2m_file_s *priv,
  FAR struct v4l2_format *fmt, bool output)
{
  int ret;

  ret = nxmutex_lock(&priv->state_lock);
  if (ret < 0)
    {
      return ret;
    }

  *fmt = output ? priv->output_fmt : priv->capture_fmt;
  nxmutex_unlock(&priv->state_lock);
  return 0;
}

static int bk7258_jpeg_m2m_capture_g_fmt(
  FAR void *arg, FAR struct v4l2_format *fmt)
{
  if (arg == NULL || fmt == NULL ||
      !bk7258_jpeg_m2m_exact_capture_type(fmt->type))
    {
      return -EINVAL;
    }

  return bk7258_jpeg_m2m_g_fmt(arg, fmt, false);
}

static int bk7258_jpeg_m2m_output_g_fmt(
  FAR void *arg, FAR struct v4l2_format *fmt)
{
  if (arg == NULL || fmt == NULL ||
      !bk7258_jpeg_m2m_exact_output_type(fmt->type))
    {
      return -EINVAL;
    }

  return bk7258_jpeg_m2m_g_fmt(arg, fmt, true);
}

static int bk7258_jpeg_m2m_s_fmt(
  FAR struct bk7258_jpeg_m2m_file_s *priv,
  FAR struct v4l2_format *fmt, bool output)
{
  struct v4l2_format normalized = *fmt;
  uint32_t width;
  uint32_t height;
  int ret;

  ret = output ? bk7258_jpeg_m2m_output_try_fmt(priv, &normalized) :
                 bk7258_jpeg_m2m_capture_try_fmt(priv, &normalized);
  if (ret < 0)
    {
      return ret;
    }

  ret = nxmutex_lock(&priv->life_lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = nxmutex_lock(&priv->state_lock);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->life_lock);
      return ret;
    }

  if (priv->closing)
    {
      ret = -ESHUTDOWN;
    }
  else if (priv->formats_locked || priv->output_on || priv->capture_on ||
           priv->inflight)
    {
      ret = -EBUSY;
    }
  else
    {
      width = normalized.fmt.pix.width;
      height = normalized.fmt.pix.height;
      if (output)
        {
          bk7258_jpeg_m2m_make_output_format(&priv->output_fmt,
                                              width, height);
          *fmt = priv->output_fmt;
        }
      else
        {
          ret = bk7258_jpeg_m2m_make_capture_format(&priv->capture_fmt,
                                                     width, height);
          if (ret >= 0)
            {
              *fmt = priv->capture_fmt;
            }
        }

      if (output)
        {
          ret = 0;
        }
    }

  nxmutex_unlock(&priv->state_lock);
  nxmutex_unlock(&priv->life_lock);
  return ret;
}

static int bk7258_jpeg_m2m_capture_s_fmt(
  FAR void *arg, FAR struct v4l2_format *fmt)
{
  return arg == NULL || fmt == NULL ? -EINVAL :
         bk7258_jpeg_m2m_s_fmt(arg, fmt, false);
}

static int bk7258_jpeg_m2m_output_s_fmt(
  FAR void *arg, FAR struct v4l2_format *fmt)
{
  return arg == NULL || fmt == NULL ? -EINVAL :
         bk7258_jpeg_m2m_s_fmt(arg, fmt, true);
}

static size_t bk7258_jpeg_m2m_g_bufsize(FAR void *arg, bool output)
{
  FAR struct bk7258_jpeg_m2m_file_s *priv = arg;
  size_t size = 0;

  if (priv == NULL || nxmutex_lock(&priv->state_lock) < 0)
    {
      return 0;
    }

  /* The generic M2M upper half does not expose REQBUFS state to the lower
   * half.  Its first size query is the only safe point to freeze the coupled
   * formats, preventing later S_FMT from invalidating allocated containers.
   * Returning zero while active also rejects REQBUFS reallocation of a
   * container currently referenced by the worker. */

  if (!priv->closing && !priv->output_on && !priv->capture_on &&
      !priv->inflight &&
      priv->output_fmt.fmt.pix.width ==
        priv->capture_fmt.fmt.pix.width &&
      priv->output_fmt.fmt.pix.height ==
        priv->capture_fmt.fmt.pix.height)
    {
      priv->formats_locked = true;
      size = output ? priv->output_fmt.fmt.pix.sizeimage :
                      priv->capture_fmt.fmt.pix.sizeimage;
    }

  nxmutex_unlock(&priv->state_lock);
  return size;
}

static size_t bk7258_jpeg_m2m_capture_g_bufsize(FAR void *arg)
{
  return bk7258_jpeg_m2m_g_bufsize(arg, false);
}

static size_t bk7258_jpeg_m2m_output_g_bufsize(FAR void *arg)
{
  return bk7258_jpeg_m2m_g_bufsize(arg, true);
}

static size_t bk7258_jpeg_m2m_g_bufcnt(FAR void *arg)
{
  return arg == NULL ? 0 : BK7258_JPEG_M2M_BUFFER_COUNT;
}

static int bk7258_jpeg_m2m_try_memory(
  FAR void *arg, enum v4l2_memory memory)
{
  if (arg == NULL)
    {
      return -EINVAL;
    }

  return memory == V4L2_MEMORY_USERPTR ? 0 : -ENOTSUP;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_jpeg_m2m_register(FAR const char *devpath)
{
  int ret;

  if (devpath == NULL || devpath[0] == '\0')
    {
      return -EINVAL;
    }

  ret = bk7258_jpeg_m2m_check_config();
  if (ret < 0)
    {
      return ret;
    }

  ret = nxmutex_lock(&g_bk7258_jpeg_m2m_device_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (g_bk7258_jpeg_m2m_registered)
    {
      nxmutex_unlock(&g_bk7258_jpeg_m2m_device_lock);
      return -EALREADY;
    }

  ret = codec_register(devpath, &g_bk7258_jpeg_m2m_codec);
  if (ret >= 0)
    {
      g_bk7258_jpeg_m2m_registered = true;
    }

  nxmutex_unlock(&g_bk7258_jpeg_m2m_device_lock);
  return ret;
}
